#+TITLE: Grafter V0.2 DSL Notes
#+AUTHOR: Rick Moynihan

This file consists of some notes about how grafter 0.2 is fitting
together.  Its primary purpose is to try and open up how the DSL is
built and how it fits together for further discussion.

These notes are currently maintained by Rick as an [[http://orgmode.org/][Org babel]],
(literate programming) document - primarily for convenience while
things are changing.  When things stabilise I can export it as
markdown.

All of the grafter functions from grafter.tabular can be refered into
your chosen namespace (=grafter.api.examples=) like so:

#+BEGIN_SRC clojure :results none
  (ns grafter.api.examples
    (:require [grafter.tabular :refer :all]
              [grafter.sequences :refer :all]))
#+END_SRC

** TODO open-tabular-file

*NOTE:* Not sure this functions behaviour is correct.

This is a mid-level entry point to loading tabular data into grafter.
If you're looking at loading many dataset files, you should prefer
=open-all-datasets=.

=open-tabular-file= is implemented as a multimethod that dispatches on
a keywordized file extension by default.  Alternatively users can
overide this default behaviour by providing an optional =:ext= option
with a keyword indicating the type of file to be processed.

Grafter currently supports =:xls=, =:xlsx= and =:csv= file types.

#+BEGIN_SRC clojure :results raw
(open-tabular-file "./test/grafter/test.csv")
#+END_SRC

#+RESULTS:
(["one" "two" "three"] ["1" "2" "3"])
